DELETE FROM category;
INSERT INTO category (id,parent_id,name,level,sort_order) VALUES
-- 一级1：生鲜（门店C位放最前）
(1,0,'生鲜果蔬肉禽',1,1),
(101,1,'新鲜水果',2,1),
(102,1,'时令蔬菜',2,2),
(103,1,'猪牛羊肉',2,3),
(104,1,'海鲜水产',2,4),
(105,1,'禽肉蛋品',2,5),
(106,1,'冷冻速食',2,6),
(107,1,'熟食卤味',2,7),
(108,1,'甜品饮品',2,8),

-- 一级2：食品饮料、保健食品
(2,0,'食品饮料滋补',1,2),
(201,2,'休闲零食',2,1),
(202,2,'粮油米面调味',2,2),
(203,2,'酒水饮料冲调',2,3),
(204,2,'进口零食酒水',2,4),
(205,2,'地方特产礼盒',2,5),
(206,2,'茗茶茶饮',2,6),
(207,2,'保健食品滋补品',2,7),
(208,2,'食品礼券礼盒',2,8),

-- 一级3：家居日用（纸巾、收纳、雨具、床品、灯具、宠物全放这里）
(3,0,'家居百货日用品',1,3),
(301,3,'家纺床品毛巾',2,1),
(302,3,'灯具照明',2,2),
(303,3,'收纳储物用品',2,3),
(304,3,'清洁消杀纸品',2,4),
(305,3,'浴室洗漱用品',2,5),
(306,3,'雨伞雨具防护',2,6),
(307,3,'洗晒熨烫工具',2,7),
(308,3,'装饰摆件花艺',2,8),
(309,3,'宠物全品类',2,9),

-- 一级4：厨具厨房
(4,0,'厨具餐具厨房配件',1,4),
(401,4,'烹饪锅具',2,1),
(402,4,'刀剪菜板工具',2,2),
(403,4,'水杯酒具茶具',2,3),
(404,4,'碗盘餐具',2,4),
(405,4,'厨房小配件',2,5),
(406,4,'商用酒店厨具',2,6),

-- 一级5：个护美妆（沐浴露、卫生巾、洗护、彩妆集中）
(5,0,'个护美妆清洁',1,5),
(501,5,'面部护肤',2,1),
(502,5,'身体洗护沐浴',2,2),
(503,5,'洗发护发',2,3),
(504,5,'口腔护理',2,4),
(505,5,'女性卫生巾护理',2,5),
(506,5,'香水彩妆',2,6),

-- 一级6：母婴专区
(6,0,'母婴孕童用品',1,6),
(601,6,'婴幼儿奶粉',2,1),
(602,6,'辅食营养零食',2,2),
(603,6,'尿裤湿巾',2,3),
(604,6,'喂养餐具器具',2,4),
(605,6,'宝宝洗护用品',2,5),
(606,6,'童装童鞋寝具',2,6),
(607,6,'孕妈妈妈专区',2,7),
(608,6,'童车安全座椅',2,8);